---
kind: other
id: Properties.T:Autodesk.Revit.DB.Segment
source: html/df6d943a-7d77-d59c-eae2-532a3f0cbd29.htm
---
# Segment Properties

The id of the assembly instance to which the element belongs.